# üß™ Data Analysis Practice Notebook
This notebook demonstrates data analysis tasks using **Pandas**, **NumPy**, **Matplotlib**, and SQL integration with SQLAlchemy.

## üì¶ Import Required Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## üìù Create Sample Dataset

In [2]:
data_raw = [
    {'Name': 'Alice', 'Age': 25, 'Department': 'HR', 'Salary': 50000},
    {'Name': 'Bob', 'Age': 30, 'Department': 'IT', 'Salary': 60000},
    {'Name': 'Charlie', 'Age': 28, 'Department': 'Finance', 'Salary': 55000},
    {'Name': 'David', 'Age': 35, 'Department': 'IT', 'Salary': 70000},
    {'Name': 'Eva', 'Age': 40, 'Department': 'HR', 'Salary': 65000}
]

## üìä Convert to DataFrame and Display

In [3]:
df = pd.DataFrame(data_raw)
df

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   28    Finance   55000
3    David   35         IT   70000
4      Eva   40         HR   65000

## üî† Sort Columns Alphabetically

In [4]:
df.sort_index(axis=1)

   Age Department     Name  Salary
0   25         HR    Alice   50000
1   30         IT      Bob   60000
2   28    Finance  Charlie   55000
3   35         IT    David   70000
4   40         HR      Eva   65000

## üî§ Sort by Name Alphabetically

In [5]:
df.sort_values(by='Name')

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   28    Finance   55000
3    David   35         IT   70000
4      Eva   40         HR   65000

## üìâ Sort Columns in Reverse Order

In [6]:
df.sort_index(axis=1, ascending=False)

   Salary     Name Department  Age
0   50000    Alice         HR   25
1   60000      Bob         IT   30
2   55000  Charlie    Finance   28
3   70000    David         IT   35
4   65000      Eva         HR   40

## ‚ÑπÔ∏è DataFrame Info

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Department  5 non-null      object
 3   Salary      5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

## üßÆ Group Data by Department and Calculate Mean

In [8]:
demo = df.groupby('Department').mean(numeric_only=True)
demo

             Age   Salary
Department
Finance     28.0  55000.0
HR          32.5  57500.0
IT          32.5  65000.0

## ‚öôÔ∏è Connect to MySQL Database

In [9]:
from sqlalchemy import create_engine
# engine = create_engine('sqlite://', echo=False)
engine = create_engine('mysql+pymysql://root:root@localhost:3306/demo')

## üì• Fetch Data from SQL Table

In [10]:
Sql_Data_fetching = pd.read_sql("SELECT * FROM stu", con=engine)
Sql_Data_fetching

   id           name               email            course enrollment_date
0   1  Saiyam Tuteja  saiyam@example.com  Computer Science      2025-06-24
1   2  Shikha Sharma  shikha@example.com      Data Science      2025-06-23
2   3    Rahul Verma   rahul@example.com           AI & ML      2025-06-20

## üß™ (Optional) Run Filtered SQL Queries

In [11]:
# Sql_Data_fetching = pd.read_sql("SELECT * FROM stu WHERE name LIKE '%%s%%'", con=engine)
Sql_Data_fetching

   id           name               email            course enrollment_date
0   1  Saiyam Tuteja  saiyam@example.com  Computer Science      2025-06-24
1   2  Shikha Sharma  shikha@example.com      Data Science      2025-06-23
2   3    Rahul Verma   rahul@example.com           AI & ML      2025-06-20

## üìÅ Export SQL Data to Excel

In [12]:
Sql_Data_fetching.to_excel('Sql_Data_fetching.xlsx')

## üì§ Export Grouped Data to CSV

In [13]:
demo.to_csv('demo.csv', index=False)
# demo.to_clipboard()
# demo.to_dict()
# demo.to_sql(name='root', con=engine)

## üóëÔ∏è Delete File If Exists

In [14]:
# import os
# if os.path.exists('demo.html'):
#     os.remove('demo.html')
#     print("File deleted successfully")
# else:
#     print("File doesn't exist")